/*
*********************************************************************************************************
*                                              EXAMPLE CODE
*
*                          (c) Copyright 2003-2006; Micrium, Inc.; Weston, FL
*
*               All rights reserved.  Protected by international copyright laws.
*               Knowledge of the source code may NOT be used to develop a similar product.
*               Please help us continue to provide the Embedded community with the finest
*               software available.  Your honesty is greatly appreciated.
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*
*                                      APPLICATION CONFIGURATION
*
*                                     ST Microelectronics STM32
*                                              with the
*                                   STM3210B-LK1 Evaluation Board
*
* Filename      : app_cfg.h
* Version       : V1.10
* Programmer(s) : BH3NVN
*********************************************************************************************************
*/

#ifndef  __APP_CFG_H__
#define  __APP_CFG_H__

/*
*********************************************************************************************************
*                                       MODULE ENABLE / DISABLE
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                              TASKS NAMES
*********************************************************************************************************
*/


/**********************************************************************************************************
*                                       uC/OS-II任务的优先级
**********************************************************************************************************/
#define  APP_TIME_PRIO                                     2
#define  APP_MODBUS_POLL_PRIO                              3													   
#define  APP_TASK_START_PRIO                               4								  
#define  APP_LOGIN_PRIO                                    6


/**********************************************************************************************************
*                                       uC/OS-II任务的堆栈大小
*                             Size of the task stacks (# of OS_STK entries)
**********************************************************************************************************/
#define  APP_TIME_SIZE                                   128
#define  APP_MODBUS_POLL_SIZE   			     		 512
#define  APP_TASK_START_STK_SIZE                         128
#define  APP_LOGIN_SIZE                                  256



/*
*********************************************************************************************************
*                                                  LIB
*********************************************************************************************************
*/

#define  uC_CFG_OPTIMIZE_ASM_EN                 DEF_ENABLED
#define  LIB_STR_CFG_FP_EN                      DEF_DISABLED

#endif
